Revit 2027 API
Group.Location Property
This property is used to find the physical location of a group within project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override Location Location { get; }
Public Overrides ReadOnly Property Location As Location
	Get
public:
virtual property Location^ Location {
	Location^ get () override;
}
abstract Location : Location with get
override Location : Location with get
Property Value
Location
Remarks
The Location property returns an object that can be used to find the location of an object within the project. Groups return a point location object.
See Also
Reference
Group Class
Autodesk.Revit.DB Namespace